{
  "drafts": [
    {
      "title": "Markdown Language Previewer",
      "description": "Test your Markdown language skills with this React Markdown Previewer. Using the Marked library with custom options, this website is an asset for anyone who wants to preview their GitHub-flavored documents before posting them online. (Tiptop tooling for READMEs, I say!)",
      "url": "https://charmedsatyr-freecodecamp.github.io/markdown_previewer",
      "img_lg": "img/thumbs/markdown_previewer-lg.png",
      "img_sm": "img/thumbs/markdown_previewer-sm.png"
    },
    {
      "title": "Recipe Box",
      "description": "Made with React.js, React Bootstrap, and way too much SCSS. Add your own recipes and style the instructions to your taste with GitHub-flavored Markdown. Recipes will stick around until you clear your browser's cache.",
      "url": "https://charmedsatyr-freecodecamp.github.io/recipe_box/",
      "img_lg": "img/thumbs/recipe_box-lg.png",
      "img_sm": "img/thumbs/recipe_box-sm.png"
    },
    {
      "title": "Wikipedia Viewer",
      "description": "Type your query to automagically search the entire Wikipedia API for articles. If you're up for an adventure, try clicking Random and probe an obscure branch of human knowledge.",
      "url": "https://charmedsatyr-freecodecamp.github.io/wikipedia_viewer",
      "img_lg": "img/thumbs/wikipedia_viewer-lg.png",
      "img_sm": "img/thumbs/wikipedia_viewer-sm.png"
    },
    {
      "title": "freeCodeCamp",
      "description": "I'm earned <a href='https://www.freecodecamp.org/charmedsatyr/front-end-certification' rel='noopener' target='_blank'><span>Front End</span></a> and <a href='https://www.freecodecamp.org/charmedsatyr/back-end-certification' rel='noopener' target='_blank'><span>Back End Development</span></a> certifications through <a href='https://www.freecodecamp.org' rel='noopener' target='_blank'><span>freeCodeCamp</span></a>, and I am working my way through the data visualization and computer science courses. You can view my projects and 350+ challenge solutions on my <a href='https://www.freecodecamp.org/charmedsatyr' rel='noopener' target='_blank'><span>profile page</span></a>.",
      "url": "https://freecodecamp.org/charmedsatyr",
      "img_lg": "img/thumbs/freecodecamp-lg.png",
      "img_sm": "img/thumbs/freecodecamp-sm.png"
    }
  ],
  "sites": [
    {
      "title": "charmed.social",
      "description": "I'm building my skills as a sysadmin! <a href='https://joinmastodon.org' rel='noopener noreferrer'><span>Mastodon</span></a> is a free, open-source, federated microblogging network. Users on each server can interact with everyone else on compatible protocols, just like people with different email providers can. Better: server admins can set their own content and moderation policies and modify the software as they see fit. I'm getting pretty comfortable running my instance on NginX, PostgreSQL, Redis, Ruby on Rails, React, and Redux without downtime on a solar-powered Ubuntu box.",
      "url": "https://charmed.social",
      "img_lg": "img/thumbs/charmed_social-lg.png",
      "img_sm": "img/thumbs/charmed_social-sm.png"
    },
    {
      "title": "Sorcerer City",
      "description": "This fantasy-themed, Pinterest-like inspiration engine posts your images and snaps them to a best-fit React Masonry grid. Built on Node.js with React, Express, Mongoose, and Semantic UI React, the app employs a websocket layer to instantly show you others' posts and likes even if you don't refresh your browser.",
      "url": "https://sorcerer-city.herokuapp.com",
      "img_lg": "img/thumbs/sorcerer_city-lg.png",
      "img_sm": "img/thumbs/sorcerer_city-sm.png"
    }, { "title": "Charmed Books",
    "description": "Love to read? Form a book trading club with your friends, and manage your swaps using this MERN app! Material UI provides a colorful interface that enables users to add books from the Open Library API and request swaps with anyone in the community. Up-to-date book requests and ownership will appear in real time thanks to Socket.io. And don't worry about your password being stolen—only a salted hash will be stored in the database <span class='fa fa-lock'/>.", "url": "https://charmed-books.herokuapp.com",
      "img_lg": "img/thumbs/charmed_books-lg.png",
      "img_sm": "img/thumbs/charmed_books-sm.png"
    },
    {
      "title": "op.pe",
      "description": "Not to put too fine a point on it, but <strong>bit.ly</strong> is six characters long. <strong>op.pe</strong>? A mere five! Shorten your links with this Mustache-powered app. Engineered with Bootstrap to look great on tablets and mobile devices, it painlessly transforms the longest links you've got into five digits of a SHA-256 hash. Like all my full stack apps, op.pe only serves HTTPS pages. Your social media team will thank you for your consideration.",
      "url": "https://op.pe",
      "img_lg": "img/thumbs/op_pe-lg.png",
      "img_sm": "img/thumbs/op_pe-sm.png"
    },
    {
      "title": "The Game of Life",
      "description": "British mathematician John Conway designed the Game of Life in 1970 to model the evolution of a system given an initial state and set of rules. If you've got a grand total of zero players handy, you can check out my version of the cellular automaton built with React, Redux, and SCSS. Each cell is \"aware\" of what its neighbors are doing, and future \"generations\" develop with blazing speed... and 100% test coverage!",
      "url": "https://charmedsatyr-freecodecamp.github.io/game_of_life/",
      "img_lg": "img/thumbs/game_of_life-lg.png",
      "img_sm": "img/thumbs/game_of_life-sm.png"
    },
    {
      "title": "Simon Game",
      "description": "This digital remake of Milton Bradley's classic 1978 memory game is made with jQuery and oodles of SCSS. Strict mode is unforgiving, and the game speeds up as you progress. Score 20 points to hear the victory tune!",
      "url": "https://charmedsatyr-freecodecamp.github.io/simon_game",
      "img_lg": "img/thumbs/simon_game-lg.png",
      "img_sm": "img/thumbs/simon_game-sm.png"
    },
    {
      "title": "Charmed.Tech",
      "description": "This site! I didn't write the descriptions you're reading now in HTML—they've been dynamically interpolated from a JSON object using Gulp and Pug. This and other development tricks (think automatic image resizing, BrowserSync streaming, script injection...) make adding new content a breeze. If you want me to write easily-maintained code for your project, head to the <a href='#contact'><span>contact form</span></a> I wrote in PHP. Or to see more of my work, check out <a href='https://www.charmedsatyr.com' rel='noopener' target='_blank'><span>my development site</span></a>.",
      "url": "#contact",
      "img_lg": "img/thumbs/charmed_tech-lg.png",
      "img_sm": "img/thumbs/charmed_tech-sm.png"
    }
  ]
}
