{
  "sites": [
    {
      "title": "Recipe Box",
      "description":
        "Made with React.js, React Bootstrap, and oodles of SCSS. Add your own recipes and style the instructions to your taste! Recipes will stick around until you clear your browser's cache.",
      "url": "#",
      "img": "img/recipe_box-750x500.png"
    },

    { "title": "testy", "description": "I am a very testy soul, a testy soul indeed. I love to put your ass on the line and then squeeze your balls till you bleed!", "url": "#", "img": "#" },
    {
      "title": "Markdown Language Previewer",
      "description":
        "Test your Markdown Language skills with this React.js Markdown Previewer! Using the Marked Library with custom options, this website is an asset for anyone who wants to preview their GitHub-flavored markup before posting documents online.",
      "url": "https://charmedsatyr.github.io/markdown_previewer",
      "img": "img/markdown_previewer-750x500.png"
    },
    {
      "title": "freeCodeCamp",
      "description":
        "I am currently learning Full Stack JavaScript Development with freeCodeCamp! I've already earned their Front End Development Certificate, and I expect to complete their Back End Development Certificate by June 2017. You can view my official certificate, 50+ algorithm solutions, and project links at my freeCodeCamp profile page.",
      "url": "https://freecodecamp.com/charmedsatyr",
      "img": "img/freecodecamp-750x500.png"
    },
    {
      "title": "Wikipedia Viewer",
      "description":
        "Type your query to automagically search the entire Wikipedia API for articles. If you're up for an adventure, try clicking Random and probe an obscure branch of human knowledge.",
      "url": "https://charmedsatyr.github.io/wikipedia_viewer",
      "img": "img/wikipedia_viewer-750x500.png"
    },
    {
      "title": "See my other projects!",
      "description":
        "My first hackathon was a Google Startup Weekend, and my team won First Prize! Check out my development site to see other projects I've worked on, read my code on GitHub, or follow me on Twitter to see what I'm up to now!",
      "url": "https://charmedsatyr.com",
      "img": "img/google_entrepreneurs.jpg"
    }
  ]
}
