{
  "sites": [
    {
      "title": "Sorcerer City",
      "description":
        "This fantasy-themed, Pinterest-like inspiration engine posts your titled images and snaps them to a best-fit React Masonry grid. Built on Node.js with React, Express, Mongoose, and Semantic UI React, the app employs a websocket layer to instantly update cards and likes even if you don't refresh your browser. All the JavaScript, down to the <code>webpack.<br/>config.b<br/>abel.js</code>, is written in ES6+. Be sure to share HTTPS image urls!",
      "url": "https://sorcerer-city.herokuapp.com",
      "img_lg": "img/thumbs/sorcerer_city-lg.png",
      "img_sm": "img/thumbs/sorcerer_city-sm.png"
    },
    {
      "title": "Charmed Books",
      "description":
        "Love to read? Form a book trading club with your friends, and manage your swaps using this MERN app! Material UI provides a colorful interface that enables users to add books from the Open Library API and request swaps with anyone in the community. Up-to-date book requests and ownership will appear in real time thanks to Socket.io. And don't worry about your password being stolen—only a salted hash will be stored in the database.",
      "url": "https://charmed-books.herokuapp.com",
      "img_lg": "img/thumbs/charmed_books-lg.png",
      "img_sm": "img/thumbs/charmed_books-sm.png"
    },
    {
      "title": "op.pe",
      "description":
        "Not to put too fine a point on it, but <strong>bit.ly</strong> is six characters long. <strong>op.pe</strong>? A mere five! Shorten your links with this straightforward full-stack app. Engineered to look great on mobile devices, it uses Mu—a fast, streaming Node.js Mustache engine—to painlessly transform the longest links you've got into five digits of a SHA-256 hash. Like all my full stack apps, op.pe only serves secure pages. Your social media team will thank you for your consideration.",
      "url": "https://op.pe",
      "img_lg": "img/thumbs/op_pe-lg.png",
      "img_sm": "img/thumbs/op_pe-sm.png"
    },
    {
      "title": "Simon Game",
      "description":
        "This digital remake of Milton Bradley's classic 1978 memory game is made with jQuery and pure Sass. Strict mode is unforgiving, and the game speeds up as you progress. Score 20 points to win!",
      "url": "https://charmedsatyr.github.io/simon_game",
      "img_lg": "img/thumbs/simon_game-lg.png",
      "img_sm": "img/thumbs/simon_game-sm.png"
    },
    {
      "title": "Recipe Box",
      "description":
        "Made with React.js, React Bootstrap, and oodles of SCSS. Add your own recipes and style the instructions to your taste! Recipes will stick around until you clear your browser's cache.",
      "url": "https://charmedsatyr.github.io/recipe_box/",
      "img_lg": "img/thumbs/recipe_box-lg.png",
      "img_sm": "img/thumbs/recipe_box-sm.png"
    },
    {
      "title": "Markdown Language Previewer",
      "description":
        "Test your Markdown Language skills with this React.js Markdown Previewer! Using the Marked Library with custom options, this website is an asset for anyone who wants to preview their GitHub-flavored markup before posting documents online.",
      "url": "https://charmedsatyr.github.io/markdown_previewer",
      "img_lg": "img/thumbs/markdown_previewer-lg.png",
      "img_sm": "img/thumbs/markdown_previewer-sm.png"
    },
    {
      "title": "Wikipedia Viewer",
      "description":
        "Type your query to automagically search the entire Wikipedia API for articles. If you're up for an adventure, try clicking Random and probe an obscure branch of human knowledge.",
      "url": "https://charmedsatyr.github.io/wikipedia_viewer",
      "img_lg": "img/thumbs/wikipedia_viewer-lg.png",
      "img_sm": "img/thumbs/wikipedia_viewer-sm.png"
    },
    {
      "title": "freeCodeCamp",
      "description":
        "I am in the final stages of earning my Full Stack JavaScript Development Certificate from freeCodeCamp! I've already learned <a href='https://www.freecodecamp.org/charmedsatyr/front-end-certification' rel='noopener' target='_blank'><span>Front End</span></a> and <a href='https://www.freecodecamp.org/charmedsatyr/back-end-certification' rel='noopener' target='_blank'><span>Back End Development</span></a>, and I am working my way through FCC's D3 and Computer Science courses. You can view my projects and 350+ challenge solutions at my freeCodeCamp <a href='https://www.freecodecamp.org/charmedsatyr' rel='noopener' target='_blank'><span>profile page</span></a>.",
      "url": "https://freecodecamp.org/charmedsatyr",
      "img_lg": "img/thumbs/freecodecamp-lg.png",
      "img_sm": "img/thumbs/freecodecamp-sm.png"
    }
  ]
}
